## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-azurelaboratory-external-dns"
      + tags     = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

  # module.awkwardweirdterribleandbaddotcom.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "awkwardweirdterribleandbad.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

  # module.azurelaboratorydotcom.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "azurelaboratory.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

  # module.azurelaboratorydotio.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "azurelaboratory.io"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

  # module.immortal-elephantdotcom.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "immortal-elephant.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

  # module.learn-azuredotcom.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "learn-azure.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

  # module.returnsnulldotcom.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = [
          + "76.76.21.21",
        ]
      + resource_group_name = "rg-azurelaboratory-external-dns"
      + tags                = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
      + ttl                 = 3600
      + zone_name           = "returnsnull.com"
    }

  # module.returnsnulldotcom.azurerm_dns_cname_record.this["blog"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "blog"
      + record              = "returnsnull.com"
      + resource_group_name = "rg-azurelaboratory-external-dns"
      + tags                = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
      + ttl                 = 300
      + zone_name           = "returnsnull.com"
    }

  # module.returnsnulldotcom.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "returnsnull.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

  # module.rodstewartdotio.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "rodstewart.io"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

  # module.thechurchoftheblueoctopusdotcom.azurerm_dns_zone.this will be created
  + resource "azurerm_dns_zone" "this" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "thechurchoftheblueoctopus.com"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-azurelaboratory-external-dns"
      + tags                      = {
          + "Billing"     = "external_dns"
          + "environment" = "production"
          + "purpose"     = "azurelaboratory-external-dns"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```
</details>